Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
/*
 * motor_send.c  (instrumented + SET_CONFIG/ACK)
 * ----------------------------------------------------------------------------
 * STM32 send side. Implements motor_on_block_ready(): each block becomes a wire
 * frame [ frame_header | rows | CRC ] in a double buffer, shipped to the Pi as an
 * SPI2 slave (full-duplex DMA) with a data-ready GPIO handshake.
 *
 *   SPI2 slave:  PB12 NSS, PB13 SCK, PB14 MISO, PB15 MOSI  (AF5), mode 0, MSB-first
 *   data-ready:  PB0 (output, high = frame waiting)
 *   DMA1 Stream4 Ch0 = SPI2_TX, DMA1 Stream3 Ch0 = SPI2_RX (carries Pi -> STM cmds)
 *
 * SET_CONFIG / ACK protocol (Pi -> STM, ACK in next outbound frame header):
 *
 *   1. After every TxRxCplt, sniff the first 4 bytes of s_rx_dummy. If they
 *      look like MOTOR_CMD_MAGIC, copy MOTOR_CMD_FRAME_BYTES into a small
 *      pending buffer and set s_cmd_pending. CRC validation is deferred.
 *
 *   2. motor_on_block_ready first assembles & arms the CURRENT frame using
 *      the CURRENT config (so the in-flight transfer never sees a partial
 *      update). THEN it processes the pending command:
 *         - bad CRC / unknown cmd / unsupported schema / out-of-range value
 *           -> NACK bits latched, no apply.
 *         - duplicate cmd_seq (Pi re-sent because it missed the ACK)
 *           -> re-latch ACK, no re-apply.
 *         - valid SET_CONFIG -> apply now (synth + motor_send update their
 *           block_rows), latch ACK_OK + CONFIG_APPLIED for the NEXT frame.
 *
 *   3. assemble_frame stamps frame_header_t.flags with the latched ACK/NACK
 *      bits and writes the low 16 bits of the most recent cmd_seq into
 *      _reserved. CONFIG_APPLIED is a one-shot: cleared after one frame.
 *      Everything else is sticky until a new command arrives.
 * ----------------------------------------------------------------------------
 */
#include "stm32f4xx_hal.h"
#include <string.h>
#include "motor_wire.h"
#include "motor_source.h"     /* motor_on_block_ready() -- we implement it */
#include "motor_send.h"
#include "motor_acquire.h"    /* runtime reconfig of the real-sensor source */

extern void Error_Handler(void);

#ifndef MOTOR_DEFAULT_BLOCK_ROWS
#define MOTOR_DEFAULT_BLOCK_ROWS  200u
#endif

/* data-ready line */
#define DR_PORT            GPIOB
#define DR_PIN             GPIO_PIN_0

#ifndef MOTOR_DR_ASSERT_DELAY_CYCLES
#define MOTOR_DR_ASSERT_DELAY_CYCLES  1000u
#endif

/* ---- diagnostic counters (read by main.c) -------------------------------- */
volatile uint32_t g_obr        = 0;
volatile uint32_t g_arm_called = 0;
volatile uint32_t g_arm_ok     = 0;
volatile uint32_t g_arm_fail   = 0;
volatile uint32_t g_sent       = 0;
volatile uint32_t g_spi_err    = 0;
volatile uint32_t g_cmd_seen   = 0;   /* commands sniffed in rx (post-CRC TBD)  */
volatile uint32_t g_cmd_ok     = 0;   /* SET_CONFIG applied                     */
volatile uint32_t g_cmd_nack   = 0;   /* SET_CONFIG rejected                    */

/* ---- state --------------------------------------------------------------- */
static SPI_HandleTypeDef s_hspi2;
static DMA_HandleTypeDef s_hdma_tx;
static DMA_HandleTypeDef s_hdma_rx;

static uint16_t s_block_rows = MOTOR_DEFAULT_BLOCK_ROWS;
static uint16_t s_frame_len  = 0;
static uint32_t s_seq        = 0;

/* The Pi clocks MOTOR_MAX_FRAME_BYTES every transfer (worst-case sizing).
 * We size BOTH the tx frames and the rx buffer to MAX. Only the first
 * s_frame_len bytes are meaningful in tx; everything beyond is whatever
 * the buffer happened to contain (the Pi ignores it anyway, frame size
 * is in the header).                                                       */
static _Alignas(8) uint8_t s_frame[2][MOTOR_MAX_FRAME_BYTES];
static _Alignas(8) uint8_t s_rx_dummy[MOTOR_MAX_FRAME_BYTES];

static volatile int s_tx_idx  = -1;
static volatile int s_pending = 0;

static volatile uint32_t s_sent    = 0;
static volatile uint32_t s_skipped = 0;

/* ---- command/ACK state --------------------------------------------------- */
static volatile uint8_t s_cmd_pending = 0;        /* set by TxRxCplt, cleared at block boundary */
static uint8_t s_pending_cmd[MOTOR_CMD_FRAME_BYTES];

static uint16_t s_latched_ack_flags    = 0;       /* MOTOR_FLAG_ACK_* / NACK_*  */
static uint16_t s_latched_cmd_seq      = 0;       /* low 16 bits of last cmd    */
static uint8_t  s_config_applied_latch = 0;       /* one-shot CONFIG_APPLIED    */
static uint16_t s_last_applied_seq     = 0xFFFFu; /* sentinel: nothing applied  */
static uint8_t  s_have_last_applied    = 0;

/* Currently-applied STM-tier config. Initialised in motor_send_init() to the
 * compile-time defaults so process_pending_cmd can diff the incoming payload
 * against it and skip HAL-touching set functions when nothing has changed. */
static config_payload_t s_active_config;

/* ---- CRC (table-driven CRC-32/MPEG-2) ------------------------------------ */
static uint32_t s_crc_table[256];

static void crc32_init(void)
{
    for (uint32_t i = 0; i < 256; ++i) {
        uint32_t c = i << 24;
        for (int j = 0; j < 8; ++j)
            c = (c & 0x80000000u) ? (c << 1) ^ 0x04C11DB7u : (c << 1);
        s_crc_table[i] = c;
    }
}

static uint32_t crc32_mpeg2(const uint8_t *d, size_t n)
{
    uint32_t crc = 0xFFFFFFFFu;
    for (size_t i = 0; i < n; ++i)
        crc = (crc << 8) ^ s_crc_table[((crc >> 24) ^ d[i]) & 0xFFu];
    return crc;
}

/* ---- frame assembly ------------------------------------------------------ */
static void assemble_frame(uint8_t *buf, const motor_row_t *rows_in, uint16_t n_rows)
{
    uint32_t seq = s_seq++;

    frame_header_t *h = (frame_header_t *)buf;
    h->magic     = MOTOR_FRAME_MAGIC;
    h->seq       = seq;
    h->timestamp = (uint64_t)HAL_GetTick() * 1000ull;
    h->version   = MOTOR_CONTRACT_VERSION;
    h->n_rows    = n_rows;

    /* ACK bits: latched (sticky until next command) + CONFIG_APPLIED one-shot. */
    uint16_t f = s_latched_ack_flags;
    if (s_config_applied_latch) {
        f |= MOTOR_FLAG_CONFIG_APPLIED;
        s_config_applied_latch = 0;
    }
    h->flags     = f;
    h->_reserved = s_latched_cmd_seq;

    /* Rows are already fully composed by the producer (motor_acquire);
     * just copy them in.                                                    */
    motor_row_t *dst = (motor_row_t *)(buf + sizeof(frame_header_t));
    memcpy(dst, rows_in, (size_t)n_rows * sizeof(motor_row_t));

    size_t covered = sizeof(frame_header_t) + (size_t)n_rows * sizeof(motor_row_t);
    uint32_t crc = crc32_mpeg2(buf, covered);
    memcpy(buf + covered, &crc, sizeof crc);

