Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
    /* Zero the slack out to MAX. The Pi clocks MAX bytes per transfer (so its
     * command frame on tx can ride alongside any block size up to MAX), so we
     * must transmit MAX bytes too -- with everything past the real frame end
     * being deterministic zeros, not stale data from a previously-larger
     * frame. The Pi ignores the slack (frame size comes from h->n_rows). */
    size_t total = covered + sizeof crc;
    if (total < MOTOR_MAX_FRAME_BYTES)
        memset(buf + total, 0, MOTOR_MAX_FRAME_BYTES - total);
}

/* ---- forward declarations (defined after arm_tx but called from it on retry) */
static void spi_init(void);
static void dma_init(void);

/* ---- transmit ------------------------------------------------------------ */
static void spin_cycles(uint32_t n)
{
    volatile uint32_t i = n;
    while (i--) __NOP();
}

static void arm_tx(int idx)
{
    g_arm_called++;

    for (int attempt = 0; attempt < 50; attempt++) {
        if (attempt > 0) {
            HAL_SPI_DMAStop(&s_hspi2);

            uint32_t cs_wait = 50000u;
            while ((GPIOB->IDR & GPIO_PIN_12) == 0u && --cs_wait) {
                __NOP();
            }
        }

        /* Clear stale OVR/FRE on EVERY attempt. DMAStop (used instead of
         * the old HAL_SPI_DeInit/Abort path) does NOT clear these flags;
         * leaving them set causes the error interrupt to re-fire
         * immediately after ErrorCallback → arm_tx, locking the STM32 in
         * an infinite error loop. The old DeInit path toggled SPE which
         * cleared all flags as a side-effect, hiding this bug.           */
        if (s_hspi2.Instance->SR & SPI_SR_OVR) {
            volatile uint32_t tmp  = s_hspi2.Instance->DR;
            tmp = s_hspi2.Instance->SR;
            (void)tmp;
        }
        if (s_hspi2.Instance->SR & SPI_SR_FRE) {
            s_hspi2.Instance->CR1 &= ~SPI_CR1_SPE;
            s_hspi2.Instance->CR1 |=  SPI_CR1_SPE;
        }

        s_tx_idx = idx;

        if (HAL_SPI_TransmitReceive_DMA(&s_hspi2, s_frame[idx], s_rx_dummy,
                                        MOTOR_MAX_FRAME_BYTES) != HAL_OK) {
            s_tx_idx = -1;
            continue;
        }

        spin_cycles(MOTOR_DR_ASSERT_DELAY_CYCLES);

        uint32_t timeout = 5000u;
        while (HAL_SPI_GetState(&s_hspi2) != HAL_SPI_STATE_BUSY_TX_RX
               && --timeout) {
            __NOP();
        }
        if (timeout == 0u) {
            HAL_SPI_DMAStop(&s_hspi2);
            s_tx_idx = -1;
            continue;
        }

        g_arm_ok++;
        HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_SET);
        spin_cycles(50u);
        return;
    }

    s_skipped++;
    g_arm_fail++;
}

/* ---- command processing ------------------------------------------------- */
/* All of these run from motor_on_block_ready, which is itself called from
 * the TIM2 ISR (same NVIC priority as the SPI/DMA ISRs, so nothing here
 * preempts and the TX in flight can't be touched mid-DMA). */

static void process_pending_cmd(void)
{
    /* Snapshot the pending command into local space and clear the slot
     * before we do anything else: if TxRxCplt fires a fresh command in
     * the middle of validation (it can't preempt us, but defensive code
     * is cheap), it'll just set the flag again and we'll see it next
     * block.                                                              */
    uint8_t buf[MOTOR_CMD_FRAME_BYTES];
    memcpy(buf, s_pending_cmd, sizeof buf);
    s_cmd_pending = 0;

    const cmd_header_t *ch = (const cmd_header_t *)buf;

    /* Magic was already checked in the sniff, but re-check defensively. */
    if (ch->magic != MOTOR_CMD_MAGIC) return;

    s_latched_cmd_seq = ch->cmd_seq;

    /* CRC over [cmd_header_t][config_payload_t]. */
    size_t covered = sizeof(cmd_header_t) + sizeof(config_payload_t);
    uint32_t got;
    memcpy(&got, buf + covered, sizeof got);
    if (crc32_mpeg2(buf, covered) != got) {
        s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_CRC;
        g_cmd_nack++;
        return;
    }

    /* Schema version. We only support exactly the compiled-in version for
     * now; older fw declines newer schemas instead of misinterpreting.   */
    if (ch->schema_version != MOTOR_CONFIG_SCHEMA_VERSION) {
        s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_VER;
        g_cmd_nack++;
        return;
    }

    switch (ch->cmd) {

    case MOTOR_CMD_PING:
        s_latched_ack_flags = MOTOR_FLAG_ACK_OK;
        g_cmd_ok++;
        return;

    case MOTOR_CMD_SET_CONFIG: {
        const config_payload_t *p =
            (const config_payload_t *)(buf + sizeof(cmd_header_t));

        /* Idempotency: if we've already applied this exact cmd_seq, just
         * re-affirm the ACK (handles Pi-side retries when its ACK was
         * missed in transit). */
        if (s_have_last_applied && ch->cmd_seq == s_last_applied_seq) {
            s_latched_ack_flags = MOTOR_FLAG_ACK_OK;
            return;
        }

        /* Range check EVERY field before we touch anything.
         * sample_rate_hz and imu_rate_hz allow 0 as a "leave alone" sentinel;
         * non-zero values must fall in the valid band.                      */
        int bad_sample = (p->sample_rate_hz != 0u &&
                          (p->sample_rate_hz < 100u || p->sample_rate_hz > 100000u));
        int bad_imu    = (p->imu_rate_hz != 0u &&
                          (p->imu_rate_hz < 10u || p->imu_rate_hz > 1000u));
        if (p->block_rows == 0u || p->block_rows > MOTOR_MAX_ROWS_PER_BLOCK ||
            p->source > MOTOR_SOURCE_ADC ||
            p->run_state > MOTOR_RUN_RUN ||
            bad_sample || bad_imu) {
            s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_RANGE;
            g_cmd_nack++;
            return;
        }

