Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
    if (inflight < 0) {
        arm_tx(build);
    } else {
        if (s_pending) s_skipped++;
        s_pending = 1;
    }

    if (s_cmd_pending) process_pending_cmd();
}

/* ---- SPI ISR callbacks --------------------------------------------------- */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *h)
{
    if (h->Instance != SPI2) return;

    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);
    s_sent++;
    g_sent++;

    /* A frame completed, so whatever is armed next starts its stall budget
     * from zero. Without this the counter carries over between transfers and
     * eventually trips tx_recover() on a perfectly healthy link. */
    s_inflight_blocks = 0;

    /* Sniff the rx for a command frame. Cheap: just compare 4 bytes. The
     * full validation (CRC, ranges) happens at the next block boundary in
     * process_pending_cmd. */
    uint32_t mag;
    memcpy(&mag, s_rx_dummy, sizeof mag);
    if (mag == MOTOR_CMD_MAGIC && !s_cmd_pending) {
        memcpy(s_pending_cmd, s_rx_dummy, MOTOR_CMD_FRAME_BYTES);
        s_cmd_pending = 1;
        g_cmd_seen++;
    }

    int just = s_tx_idx;
    HAL_SPI_DMAStop(&s_hspi2);

    if (s_pending) {
        s_pending = 0;
        arm_tx((just == 0) ? 1 : 0);
    } else {
        s_tx_idx = -1;
    }
}

/* Which error, specifically. g_spi_err alone says ~41/s are happening but not
 * what they are, and the two likely causes want opposite fixes:
 *   OVR -- the master clocked us while no DMA was armed (a read that landed in
 *          the gap between TxRxCplt and the next arm_tx, or on a stale-high
 *          data-ready). Timing problem.
 *   FRE -- NSS moved mid-frame. With SPI_NSS_HARD_INPUT that means the master
 *          deasserted chip-select part way through. Wiring or driver problem.
 * Diagnostic only; no behaviour change. */
volatile uint32_t g_err_ovr = 0, g_err_fre = 0, g_err_modf = 0,
                  g_err_dma = 0, g_err_other = 0;

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *h)
{
    if (h->Instance != SPI2) return;
    g_spi_err++;

    {
        uint32_t e = h->ErrorCode;
        if (e & HAL_SPI_ERROR_OVR)  g_err_ovr++;
        if (e & HAL_SPI_ERROR_FRE)  g_err_fre++;
        if (e & HAL_SPI_ERROR_MODF) g_err_modf++;
        if (e & HAL_SPI_ERROR_DMA)  g_err_dma++;
        if (!(e & (HAL_SPI_ERROR_OVR | HAL_SPI_ERROR_FRE |
                   HAL_SPI_ERROR_MODF | HAL_SPI_ERROR_DMA))) g_err_other++;
    }

    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);

    /* Stop DMA but keep the peripheral enabled so the master can finish
     * the current frame without getting a FRE.  Do NOT re-arm here:
     * re-arming the same buffer creates a duplicate frame (same seq)
     * which wastes the controller's time and causes the next valid frame
     * to be skipped, inflating the drop count.  Instead, let the
     * completion callback or the next capture-completion handle re-arm
     * naturally via the normal s_tx_idx / s_pending state machine.       */
    HAL_SPI_DMAStop(&s_hspi2);
    s_tx_idx = -1;
    s_inflight_blocks = 0;   /* transfer is over; next one starts fresh */
}

/* ---- init ---------------------------------------------------------------- */
static void gpio_init(void)
{
    __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_InitTypeDef g = {0};
    g.Pin       = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    g.Mode      = GPIO_MODE_AF_PP;
    g.Pull      = GPIO_NOPULL;
    g.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    g.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOB, &g);

    GPIO_InitTypeDef d = {0};
    d.Pin   = DR_PIN;
    d.Mode  = GPIO_MODE_OUTPUT_PP;
    d.Pull  = GPIO_NOPULL;
    d.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(DR_PORT, &d);
    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);
}

static void dma_init(void)
{
    __HAL_RCC_DMA1_CLK_ENABLE();

    s_hdma_tx.Instance                 = DMA1_Stream4;
    s_hdma_tx.Init.Channel             = DMA_CHANNEL_0;
    s_hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    s_hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    s_hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    s_hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    s_hdma_tx.Init.Mode                = DMA_NORMAL;
    s_hdma_tx.Init.Priority            = DMA_PRIORITY_HIGH;
    s_hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_tx) != HAL_OK) Error_Handler();
    __HAL_LINKDMA(&s_hspi2, hdmatx, s_hdma_tx);

    s_hdma_rx.Instance                 = DMA1_Stream3;
    s_hdma_rx.Init.Channel             = DMA_CHANNEL_0;
    s_hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    s_hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    /* Was DMA_MINC_DISABLE -- but we now want to CAPTURE the Pi's tx into
     * s_rx_dummy so we can sniff command frames. Enable memory increment. */
    s_hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    s_hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    s_hdma_rx.Init.Mode                = DMA_NORMAL;
    s_hdma_rx.Init.Priority            = DMA_PRIORITY_HIGH;
    s_hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_rx) != HAL_OK) Error_Handler();
    __HAL_LINKDMA(&s_hspi2, hdmarx, s_hdma_rx);

    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
    HAL_NVIC_SetPriority(SPI2_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(SPI2_IRQn);
}

static void spi_init(void)
{
    __HAL_RCC_SPI2_CLK_ENABLE();
    s_hspi2.Instance               = SPI2;
    s_hspi2.Init.Mode              = SPI_MODE_SLAVE;
    s_hspi2.Init.Direction         = SPI_DIRECTION_2LINES;
    s_hspi2.Init.DataSize          = SPI_DATASIZE_8BIT;
    s_hspi2.Init.CLKPolarity       = SPI_POLARITY_LOW;
    s_hspi2.Init.CLKPhase          = SPI_PHASE_1EDGE;
    s_hspi2.Init.NSS               = SPI_NSS_HARD_INPUT;
    s_hspi2.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    s_hspi2.Init.TIMode            = SPI_TIMODE_DISABLE;
    s_hspi2.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
    if (HAL_SPI_Init(&s_hspi2) != HAL_OK) Error_Handler();
}

