Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
void motor_send_init(uint16_t block_rows)
{
    if (block_rows == 0 || block_rows > MOTOR_MAX_ROWS_PER_BLOCK)
        block_rows = MOTOR_DEFAULT_BLOCK_ROWS;
    s_block_rows = block_rows;
    s_frame_len  = (uint16_t)(sizeof(frame_header_t)
                 + (size_t)block_rows * sizeof(motor_row_t) + sizeof(frame_crc_t));

    /* Seed s_active_config with what motor_synth_init / motor_send_init will
     * actually have programmed. Must match the synth-side defaults in
     * motor_synth.c (SYNTH_DEFAULT_PERIOD_US, SYNTH_DEFAULT_CYCLES) so an
     * incoming SET_CONFIG with the same values is correctly recognised as a
     * no-op.                                                                 */
    s_active_config.block_rows     = block_rows;
    s_active_config._reserved0     = 0u;
    s_active_config.source         = MOTOR_SOURCE_ADC;
    s_active_config.run_state      = MOTOR_RUN_RUN;
    s_active_config.sample_rate_hz = 20000u;
    s_active_config.imu_rate_hz    = 1000u;

    crc32_init();
    gpio_init();
    dma_init();
    spi_init();
}

void motor_send_set_block_rows(uint16_t block_rows)
{
    if (block_rows == 0 || block_rows > MOTOR_MAX_ROWS_PER_BLOCK) return;
    s_block_rows = block_rows;
    s_frame_len  = (uint16_t)(sizeof(frame_header_t)
                 + (size_t)block_rows * sizeof(motor_row_t) + sizeof(frame_crc_t));
}

void motor_send_get_stats(uint32_t *frames_sent, uint32_t *frames_skipped)
{
    if (frames_sent)    *frames_sent    = s_sent;
    if (frames_skipped) *frames_skipped = s_skipped;
}

/* ---- ISR plumbing -------------------------------------------------------- */
void DMA1_Stream4_IRQHandler(void) { HAL_DMA_IRQHandler(&s_hdma_tx); }
void DMA1_Stream3_IRQHandler(void) { HAL_DMA_IRQHandler(&s_hdma_rx); }
void SPI2_IRQHandler(void)         { HAL_SPI_IRQHandler(&s_hspi2); }